
import { Genre, Holiday } from './types';

export const GENRES: Genre[] = [
  '소설', '에세이', '컴퓨터/IT', '취미/실용/스포츠', '여행',
  '희곡', '경제/경영', '역사/문화', '예술/대중문화', '종교',
  '시', '자기계발', '인문/철학/심리학', '과학/기술', '정치/사회/환경'
];

export const KOREAN_HOLIDAYS: Holiday[] = [
  { date: '2024-01-01', name: '신정' },
  { date: '2024-02-09', name: '설날' },
  { date: '2024-02-10', name: '설날' },
  { date: '2024-02-11', name: '설날' },
  { date: '2024-02-12', name: '대체공휴일' },
  { date: '2024-03-01', name: '삼일절' },
  { date: '2024-04-10', name: '국회의원선거' },
  { date: '2024-05-05', name: '어린이날' },
  { date: '2024-05-06', name: '대체공휴일' },
  { date: '2024-05-15', name: '부처님오신날' },
  { date: '2024-06-06', name: '현충일' },
  { date: '2024-08-15', name: '광복절' },
  { date: '2024-09-16', name: '추석' },
  { date: '2024-09-17', name: '추석' },
  { date: '2024-09-18', name: '추석' },
  { date: '2024-10-03', name: '개천절' },
  { date: '2024-10-09', name: '한글날' },
  { date: '2024-12-25', name: '크리스마스' },
];
